#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий


Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка ИЛИ Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПредыдущееСостояние = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ссылка, "Состояние");
	
	Если Состояние <> ПредыдущееСостояние Тогда
		
		ДополнительныеСвойства.Вставить("ЗаписыватьНовоеСостояние", Истина);
		
	КонецЕсли;
	
	Если Состояние <> Перечисления.СостоянияВерсии.ПолучениеВерсии 
		И НЕ ПолучитьФункциональнуюОпцию("ИспользоватьОчередиВыполнения")
		ИЛИ НЕ ЗначениеЗаполнено(Источник) Тогда
		Источник = Неопределено;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка ИЛИ Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ЗаписыватьНовоеСостояние") Тогда
		
		ТекущаяДатаСеанса = ТекущаяДатаСеанса();
		
		НаборЗаписей = РегистрыСведений.СостоянияВерсии.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.ВерсияХранилища.Установить(Ссылка);
		НаборЗаписей.Отбор.Период.Установить(ТекущаяДатаСеанса);
		
		Запись = НаборЗаписей.Добавить();
		Запись.Период = ТекущаяДатаСеанса;
		Запись.ВерсияХранилища = Ссылка;
		Запись.Состояние = Состояние;
		
		НаборЗаписей.Записать();
		
	КонецЕсли;
	
	Если Состояние = Перечисления.СостоянияВерсии.ВерсияПомещена
		И (ЗначениеЗаполнено(КаталогИБ) 
		ИЛИ ЗначениеЗаполнено(КаталогФайловКонфигурации)
		ИЛИ ЗначениеЗаполнено(КаталогВременныхФайлов))Тогда
		
		КонвертацияХранилища.УдалитьФайлыВерсииВФоне(Ссылка);
		
	КонецЕсли;
	
КонецПроцедуры




#КонецОбласти

#КонецЕсли