// Copyright (c) 2017-2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

&Вместо("ЭтоВерсияПлатформы8315ИлиВыше")
Функция ОптимизацияВыгрузки_ЭтоВерсияПлатформы8315ИлиВыше(Знач ВерсияПлатформы)
	
	Результат = ПродолжитьВызов(ВерсияПлатформы);
	
	Если НЕ Результат Тогда
		
		Версия8315 = КонвертацияХранилища.ОптимизацияВыгрузки_ПолучитьВерсиюПлатформы();
		
		Результат = ЗначениеЗаполнено(Версия8315);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#КонецЕсли