
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("Хранилище", Параметры.Хранилище);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицыФормыСписок

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)

    Для Каждого Строка Из Строки Цикл
        Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Строка.Значение.Данные.РегламентноеЗадание);	
        Если Задание <> Неопределено Тогда
            Строка.Значение.Данные.Используется = Задание.Использование;
        КонецЕсли; 
    КонецЦикла; 

КонецПроцедуры

#КонецОбласти