// Copyright (c) 2017-2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область Расширения

&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ВерсияПлатформы = ПрочитатьВерсиюПлатформы();
	Оповещение = Новый ОписаниеОповещения("ПоказатьВводСтрокиЗавершение", ЭтотОбъект, Новый Структура("ВерсияПлатформы", ВерсияПлатформы), , );
	ПоказатьВводСтроки(Оповещение, ВерсияПлатформы, НСтр("ru = 'Укажите установленную версию 1С:Предприятия 8.3.15.ххх для оптимизации выгрузки'"), 25, Ложь);
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПрочитатьВерсиюПлатформы()
	
	Возврат КонвертацияХранилища.ОптимизацияВыгрузки_ПолучитьВерсиюПлатформы();
	
КонецФункции

&НаКлиенте
Процедура ПоказатьВводСтрокиЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> ДополнительныеПараметры.ВерсияПлатформы 
		И (НЕ ЗначениеЗаполнено(Результат) 
		ИЛИ ОбщегоНазначенияКлиентСервер.СравнитьВерсии(Результат, "8.3.15.0") > 1) Тогда
		СохранитьВерсиюПлатформы(Результат);
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура СохранитьВерсиюПлатформы(ВерсияПлатформы)
	
	КонвертацияХранилища.ОптимизацияВыгрузки_СохранитьВерсиюПлатформы(ВерсияПлатформы);
	
КонецПроцедуры

#КонецОбласти
