///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2017-2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ВерсииПлатформыХранилища_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	
	СисИнфо = Новый СистемнаяИнформация;
	Элементы.ВерсииПлатформыХранилища.ПодсказкаВвода = СисИнфо.ВерсияПриложения;
	Элементы.ВерсииПлатформыХранилища.СписокВыбора.Очистить();
	
	Для Каждого ДоступнаяВерсия Из ОбщегоНазначенияПовтИсп.СписокДоступныхВерсийПлатформы() Цикл
	
		Элементы.ВерсииПлатформыХранилища.СписокВыбора.Добавить(ДоступнаяВерсия);
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
