
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Отбор.Свойство("Владелец") Тогда
	
		Элементы.Владелец.Видимость = Ложь;
		
	КонецЕсли; 
	
	Состав.Параметры.УстановитьЗначениеПараметра("Ссылки", Справочники.ВерсииХранилища.ПустаяСсылка());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Состав.Параметры.УстановитьЗначениеПараметра("Ссылки", Элементы.Список.ВыделенныеСтроки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьСостояниеВерсияПолучена(Команда)
	
	УстановитьСостояниеНаСервере(Элементы.Список.ВыделенныеСтроки, "ВерсияПолучена");
	ОповеститьОбИзмененииВыделенныеСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСостояниеВерсияВыгружена(Команда)
	
	УстановитьСостояниеНаСервере(Элементы.Список.ВыделенныеСтроки, "ВерсияВыгружена");
	ОповеститьОбИзмененииВыделенныеСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьСостояниеМетаданныеЗагружены(Команда)
	
	УстановитьСостояниеНаСервере(Элементы.Список.ВыделенныеСтроки, "МетаданныеЗагружены");
	ОповеститьОбИзмененииВыделенныеСтроки();
	
КонецПроцедуры

&НаКлиенте
Процедура СброситьСостояние(Команда)
	
	УстановитьСостояниеНаСервере(Элементы.Список.ВыделенныеСтроки, "ПустаяСсылка");
	ОповеститьОбИзмененииВыделенныеСтроки();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура УстановитьСостояниеНаСервере(Знач ВыделенныеСтроки, Знач Состояние)
	
	Если НЕ ЗначениеЗаполнено(Состояние) ИЛИ ВыделенныеСтроки.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Если Состояние = "ПустаяСсылка" Тогда
	
		СостояниеСсылка = Перечисления.СостоянияВерсии.ПустаяСсылка();
	
	Иначе
	
		СостояниеСсылка = Перечисления.СостоянияВерсии[Состояние];
	
	КонецЕсли; 
	
	
	Для Каждого Ссылка Из ВыделенныеСтроки Цикл
		ВерсияОбъект = Ссылка.ПолучитьОбъект();
		ВерсияОбъект.Состояние = СостояниеСсылка;
		ВерсияОбъект.ВыгрузкаИзменений = Ложь;
		ВерсияОбъект.Записать();
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьОбИзмененииВыделенныеСтроки()

	Для Каждого Ссылка Из Элементы.Список.ВыделенныеСтроки Цикл
		ОповеститьОбИзменении(Ссылка);
	КонецЦикла;
		
КонецПроцедуры

#КонецОбласти

