// Copyright (c) 2017-2019, ООО 1С-Софт
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии Attribution-ShareAlike 4.0 International (CC BY-SA 4.0)
// Текст лицензии доступен по ссылке:
// https://creativecommons.org/licenses/by-sa/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Серверные процедуры и функции для включения оптимизации на Платформе 8.3.15
// 
////////////////////////////////////////////////////////////////////////////////

#Область СлужебныйПрограммныйИнтерфейс

&Вместо("СохранитьФайлИнформацииВыгрузки")
Процедура ОптимизацияВыгрузки_СохранитьФайлИнформацииВыгрузки(Параметры) Экспорт
	
	Если Параметры.Это8315 Тогда
		ПродолжитьВызов(Параметры);
	Иначе
		
		ВерсияПлатформы8315 = ОптимизацияВыгрузки_ПолучитьВерсиюПлатформы();
		Параметры.Вставить("Это8315",  ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ВерсияПлатформы8315, "8.3.15.0") > 1);
		
		Если Параметры.Это8315 Тогда 
			ДобавитьЗаписьВЛог(Параметры, НСтр("ru='Включенна оптимизация выгрузки на платформе 8.3.15'"));
		
			Параметры.Вставить("СохранитьФайлИнформацииВыгрузки", Истина);

			ВерсияПлатформы = Параметры.ВерсияПлатформы;
			Параметры.ВерсияПлатформы = ВерсияПлатформы8315;
			ПараметрыКаталогаИсполняемогоФайлаНаСервере(Параметры);

			ПродолжитьВызов(Параметры);

			Параметры.ВерсияПлатформы = ВерсияПлатформы;
			ПараметрыКаталогаИсполняемогоФайлаНаСервере(Параметры);
		
			ЗаменитьВерсиюФормата(Параметры);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&Вместо("ПолучитьПараметрыОбработкиВерсии")
Функция ОптимизацияВыгрузки_ПолучитьПараметрыОбработкиВерсии(Знач ВерсияХранилища) Экспорт
	
	Параметры = ПродолжитьВызов(ВерсияХранилища);
	
	Если НЕ Параметры.Это8315 Тогда
		ВерсияПлатформы = ОптимизацияВыгрузки_ПолучитьВерсиюПлатформы();
		
		Параметры.Вставить("Это8315", ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ВерсияПлатформы, "8.3.15.0") > 1);
	КонецЕсли;
	
	Возврат Параметры;
	
КонецФункции


Функция ОптимизацияВыгрузки_ПолучитьВерсиюПлатформы() Экспорт
	
	ВерсияПлатформы = ХранилищеОбщихНастроек.Загрузить(Метаданные.ПрефиксИмен, "ВерсияПлатформы");
	Если ТипЗнч(ВерсияПлатформы) <> Тип("Строка") Тогда
		ВерсияПлатформы = "";
	КонецЕсли;
	Возврат ВерсияПлатформы;
	
КонецФункции

Процедура ОптимизацияВыгрузки_СохранитьВерсиюПлатформы(Знач ВерсияПлатформы) Экспорт
	
	Если ТипЗнч(ВерсияПлатформы) <> Тип("Строка") Тогда
		ВерсияПлатформы = "";
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(ВерсияПлатформы) 
		ИЛИ ОбщегоНазначенияКлиентСервер.СравнитьВерсии(ВерсияПлатформы, "8.3.15.0") > 1 Тогда
		ХранилищеОбщихНастроек.Сохранить(Метаданные.ПрефиксИмен, "ВерсияПлатформы", ВерсияПлатформы);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заменить версию формата в ConfigDumpInfo.xml
Процедура ЗаменитьВерсиюФормата(Параметры)
	//TODO: Реализация
КонецПроцедуры

#КонецОбласти
