#Область ОбработчикиСобытийТаблицыФормыСписок

&НаСервереБезКонтекста
Процедура СписокПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
    
    Для Каждого Строка Из Строки Цикл
        Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Строка.Значение.Данные.РегламентноеЗадание);	
        Если Задание <> Неопределено Тогда
            Строка.Значение.Данные.КонвертироватьПоРасписанию = Задание.Использование;
        КонецЕсли; 
    КонецЦикла;
     
КонецПроцедуры


#КонецОбласти
